/*
Dart тилинде "Built-in Types" деген — бул тилде алдын ала аныкталган, 
негизги маалымат түрлөрү. Бул түрлөр 
Dart программалоо тилинде күнүмдүк колдонулуучу маалыматтарды иштетүү үчүн колдонулат. 
📌1. int (бүтүн сандар)
int — бүтүн сандарды сактоо үчүн колдонулат.
int age = 25;
📌 2. double (ондук сандар)
double — ондук тактыктагы сандар үчүн (көбүнчө үтүрү бар сандар).
double temperature = 36.6;
📌 3. String (текст же сап)
String — тексттик маалыматтарды сактоо үчүн.
String name = "Айзада";
📌 4. bool (логикалык маанилер)
bool — логикалык маанини билдирет: true же false.
bool isOnline = true;
📌 5. List (тизме, массив)
List — бир нече маанилердин тизмеги.
List<String> fruits = ["алма", "банан", "өрүк"];
📌 6. Map (жуп — ачкыч жана маани)
Map — ачкыч менен маанинин жуптары.
Map<String, String> capitalCities = {
  "Кыргызстан": "Бишкек",
  "Казакстан": "Астана"
};
📌 7. Runes (Юникод символдору)
Runes — Unicode символдорду колдонууга мүмкүндүк берет.
var heart = '\u2665'; // ♥
📌 8. Symbol (Символ түрү)
Symbol — Dart’тагы идентификаторлорду символ катары көрсөтөт. 
Көбүнчө метапрограммалоодо колдонулат.
Symbol s = #myIdentifier;
*/
